Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །
en: “Śāradvatī­putra, the non-arising, non-affliction, and non-purification of the eyes are without foundation.

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་ཀྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །
en: Similarly, the non-arising, non-affliction, and non-purification of the ears, nose, tongue, and body are without foundation, and in the same vein, the non-arising, non-affliction, and non-purification of [all sense organs], up to and including the mental faculty, are without foundation.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་བར་གྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་མིག་གི་ཁམས་ཀྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །
en: Similarly, the non-arising, non-affliction, and non-purification of the sensory element of the eyes are without foundation, and in the same vein, the non-arising, non-affliction, and non-purification of [all other sensory elements], up to and including the sensory element of mental consciousness, are without foundation.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན།
en: Similarly, the non-arising, non-affliction, and non-purification of the applications of mindfulness are without foundation, and in the same vein, the non-arising, non-affliction, and non-purification of [all other causal attributes], up to and including the noble eightfold path, are without foundation.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་སྐྱེ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་གི་སྐྱེ་བ་མེད་པ་དང་།
en: “Śāradvatī­putra, just as the non-arising, non-affliction, and non-purification of the ten powers of the tathāgatas are without foundation, in the same vein, the non-arising, non-affliction, and non-purification of [all other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are without foundation.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་པ་ཡིན་ནོ། །
en: As in all these cases, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being abiding in the transcendent perfection of wisdom, is non-existent.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་དྲུག་པ།
en: “Śāradvatī­putra, just as the utter purity of the applications of mindfulness is without foundation, and, in the same vein, just as the utter purity [of all other causal attributes], up to and including the noble eightfold path, is without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། བདག་མེད་པ་ཉིད་ཀྱི་ཕྱིར་བདག་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་མེད་པའི་ཕྱིར་སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་ལས་སྐྱེས་དང་། ཤེད་བུ་དང་། བྱེད་དུ་འཇུག་པ་པོ་དང་། བྱེད་པ་པོ་དང་། སློང་བ་པོ་དང་། ཀུན་ནས་སློང་བ་པོ་དང་།
en: “Śāradvatī­putra, just as the utter purity of the ten powers of the tathāgatas is without foundation, and, in the same vein, just as the utter purity [of all other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, is without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom is non-existent.

source: ཚོར་བ་པོ་དང་། ཚོར་བར་བྱེད་པ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་རྣམས་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །
en: “Śāradvatī­putra, just as the utter purity of self is without foundation on account of selflessness, and, in the same vein, just as the utter purity of [the notions of] sentient beings, living organisms, lives, individuals, humankind, human beings, agents, actors, petitioners, instigators, experiencers, experiencing subjects, knowers, and viewers is without foundation owing to the absence of knowers, viewers, and so on, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ལ་མུན་པའི་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །
en: “Śāradvatī­putra, just as darkness when the sun has risen is without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བསྲེགས་པའི་བསྐལ་པ་འབྱུང་བ་ན། འདུ་བྱེད་དུ་གཏོགས་པ་ཐམས་ཅད་ཀྱི་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་གཞི་མེད་དོ། །དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ལ་སེམས་རྣམ་པར་གཡེང་བའི་གཞི་མེད་དོ། །
en: Similarly, Śāradvatī­putra, just as when an eon of conflagration will occur, all that is included in conditioned phenomena will be without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕུང་པོ་ལ་འཆལ་བའི་ཤེས་རབ་ཀྱི་གཞི་མེད་དོ། །དེ་བཞིན་དུ་རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་ལ་ཡང་། རྣམ་པར་མ་གྲོལ་བའི་གཞི་མེད་དོ། །དེ་བཞིན་དུ་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ལ་ཡང་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་མ་ཡིན་པའི་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། དེ་བཞིན་གཤེགས་པའི་འོད་དང་། ཟླ་བ་དང་ཉི་མའི་འོད་ལ་གཞི་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། སུམ་ཅུ་རྩ་གསུམ་དང་། འཐབ་བྲལ་དང་།
en: “Śāradvatī­putra, just as [the notion of] degenerate morality with respect to the aggregate of ethical discipline possessed by the tathāgatas, arhats, and completely perfect buddhas is without foundation, and similarly, just as the [notion of] mental distraction with respect to their meditative stability is without foundation, and similarly, just as the [notion of] stupidity with respect to their aggregate of wisdom is without foundation, and similarly, just as the [notion of] non-liberation with respect to their aggregate of liberation is without foundation, and similarly, just as [the notion of] the misperception of liberating gnosis with respect to their aggregate that perceives liberating gnosis is without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། དེ་བཞིན་དུ་ཚངས་རིས་ནས་གནས་གཙང་མའི་བར་གྱི་ལྷ་རྣམས་ཀྱི་འོད་ལ་གཞི་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་མེད་དོ། །
en: “Śāradvatī­putra, just as the light of the tathāgatas and the light of the moon and the sun are without foundation, and, in the same vein, just as the light of the gods of the Trayas­triṃśa, Yāma, Tuṣita, Nirmāṇa­rata, and Para­nirmita­vaśa­vartin realms, and similarly, the light of the gods [of the world system of form], extending from the Brahmakāyika realm as far as the Pure Abodes, are without foundation, in the same way, Śāradvatī­putra, the meaning of the term ‘bodhisattva’ as a great bodhisattva being, abiding in the transcendent perfection of wisdom, is non-existent.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ།
en: If you ask why, Śāradvatī­putra, it is because all those phenomena which enlightenment denotes and which the meaning of the term ‘bodhisattva’ denotes are neither conjoined nor disjoined, and they are immaterial, unrevealed, and unobstructed.

source: བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟ་སྟེ། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་ཡིན་པས།
en: That is to say, their only defining characteristic is that they are without defining characteristics.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ལ་མ་ཆགས་པར་བསླབ་པར་བྱའོ། །
en: Therefore, Śāradvatī­putra, great bodhisattva beings should train without attachment to anything.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་དོན་གང་ལགས་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ལགས། མི་ལྡན་པ་ཡང་མ་ལགས། གཟུགས་མ་མཆིས་པ། བསྟན་དུ་མ་མཆིས་པ། ཐོགས་པ་མ་མཆིས་པ། འདི་ལྟ་སྟེ། མཚན་ཉིད་མ་མཆིས་པར་མཚན་ཉིད་གཅིག་པ་ལགས་ན། འོ་ན་ལ་ལ་ཞིག་འདི་སྐད་དུ་འདྲི་སྟེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ།
en: Then the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord!

source: ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟ་སྟེ། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་ཡིན་ན། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ།
en: If all those phenomena which enlightenment denotes, and which the meaning of the term ‘bodhisattva’ denotes are neither conjoined nor disjoined, and immaterial, unrevealed, and unobstructed, that is to say, if their only defining characteristic is that they are without defining characteristics, there are some who might ask that if all those phenomena are neither conjoined nor disjoined, and immaterial, unrevealed, and unobstructed, that is to say, if their only defining characteristic is that they are without defining characteristics, how then could this illusory person, after training in the transcendent perfection of wisdom, attain emancipation in omniscience?

source: ཞེས་དེ་སྐད་དུ་དྲིས་ན། དེ་ལ་བདག་གིས་ལན་ཇི་སྐད་དུ་གདབ་པར་བགྱི།
en: If they were to ask such a question, how should I respond?

source: དེ་བཞིན་དུ་ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ།
en: “Similarly, how could this illusory person attain emancipation in omniscience after training in the transcendent perfection of meditative concentration, training in the transcendent perfection of perseverance, training in the transcendent perfection of tolerance, training in the transcendent perfection of ethical discipline, and training in the transcendent perfection of generosity?

source: དེ་བཞིན་དུ་ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ།
en: Similarly, how could this illusory person attain emancipation in omniscience after training in the applications of mindfulness, and, in the same vein, how could this illusory person attain emancipation in omniscience after training in [the other causal attributes], up to and including the noble eightfold path?

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ།
en: In the same vein, how could this illusory person attain emancipation in omniscience after training in the ten powers of the tathāgatas?

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ་ཞེས་བགྱི་བ་ནས།
en: In the same vein, how could this illusory person attain emancipation in omniscience after training in [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?

source: ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ་ཞེས་དྲིས་ན།
en: Then, how could this illusory person attain emancipation in omniscience after training in omniscient gnosis?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལ་བདག་གིས་ལན་ཇི་སྐད་གདབ་པར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: If they were to ask such questions, Reverend Lord, how should I respond?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེའི་ཕྱིར་ཁྱོད་ཉིད་ལ་དྲིས། ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་ལྟར་ལན་ཐོབ་ཤིག །
en: “Śāradvatī­putra, to that end, I will question you and you may answer as best you can.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Śāradvatī­putra, do you think that physical forms are one thing, and that illusions are another?

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Similarly, do you think that feelings, perceptions, formative predispositions, and consciousness are one thing, and that illusions are another?

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Śāradvatī­putra, do you think that the applications of mindfulness are one thing, and that illusions are another?

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: In the same vein, do you think that [the other causal attributes] up to and including the noble eightfold path are one thing, and that illusions are another?

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན། སྟོང་པ་ཉིད་ཀྱང་གཞན་ལ།
en: Śāradvatī­putra, do you think that the ten powers of the tathāgatas are one thing, and that illusions are another, and in the same vein, do you think that [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are one thing, and that illusions are another?

source: སྒྱུ་མ་ཡང་གཞན། མཚན་མ་མེད་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན། སྨོན་པ་མེད་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Do you think that emptiness is one thing, and that illusions are another, or that signlessness is one thing, and that illusions are another, or that aspirationlessness is one thing, and that illusions are another?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that enlightenment is one thing, and that illusions are another?”

source: དེ་ལྟར་ན་གཟུགས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: “Physical forms are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་གཟུགས་ཡིན་ལ། གཟུགས་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is physical forms, and physical forms themselves are illusion.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, feelings, perceptions, formative predispositions, and consciousness are not one thing, and illusions another.

source: རྣམ་པར་ཤེས་པ་ཉིད་སྒྱུ་མ་ཡིན་ལ། སྒྱུ་མ་ཉིད་རྣམ་པར་ཤེས་པ་ཡིན་ནོ། །
en: Consciousness [and the other aggregates] are themselves illusion, and illusion itself is consciousness [and the other aggregates].

source: དེ་བཞིན་དུ་མིག་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, the eyes are not one thing, and illusions another.

source: མིག་ཉིད་སྒྱུ་མ་ཡིན་ལ། སྒྱུ་མ་ཉིད་མིག་ཡིན་ནོ། །
en: The eyes themselves are illusion, and illusion itself is the eyes.

source: དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, [all the other sense organs], up to and including the mental faculty, and in the same vein, [all phenomenological categories], up to and including feelings conditioned by sensory contact that is visually compounded, are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡིན་ལ། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is feelings conditioned by sensory contact that is visually compounded, and feelings conditioned by sensory contact that is visually compounded are themselves illusion.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: [The other aspects of feelings], up to and including feelings conditioned by sensory contact that is mentally compounded, are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡིན་ལ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is feelings conditioned by sensory contact that is mentally compounded, and feelings conditioned by sensory contact that is mentally compounded are themselves illusion.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, the applications of mindfulness are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཡིན་ལ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion is itself the applications of mindfulness, and applications of mindfulness are themselves illusion.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: In the same vein, [all the other causal attributes], up to and including the noble eightfold path, are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡིན་ལ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is the noble eightfold path, and the noble eightfold path itself is illusion.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, the ten powers of the tathāgatas are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡིན་ལ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is the ten powers of the tathāgatas, and the ten powers of the tathāgatas are themselves illusion.

source: དེ་བཞིན་དུ་རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, the gateways to liberation are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ཡིན་ལ། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion is itself the gateways to liberation, and the gateways to liberation are themselves illusion.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: In the same vein, [all the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are not one thing, and illusions another.

source: སྒྱུ་མ་ཉིད་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡིན་ལ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཉིད་སྒྱུ་མ་ཡིན་ནོ། །
en: Illusion itself is the eighteen distinct qualities of the buddhas, and the eighteen distinct qualities of the buddhas themselves are illusion.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འོ་ན་སྒྱུ་མ་དེ་ལ་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བ་དམིགས་སྙམ་འམ། གསོལ་པ།
en: The Blessed One then said, “In that case, Śāradvatī­putra, do you think that there is affliction or purification with respect to that illusion?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འོ་ན་སྒྱུ་མ་ལ་སྐྱེ་བའམ། འགག་པ་ཡོད་སྙམ་འམ། གསོལ་པ།
en: “Then, Śāradvatī­putra, do you think that there is arising or ceasing with respect to that illusion?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གང་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མི་སྣང་བ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་སྙམ་འམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྗེས་སུ་འཐོབ་པར་འགྱུར་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that that which is without arising, ceasing, affliction, and purification can train in the transcendent perfection of wisdom and attain emancipation in omniscience, or do you think that that can subsequently reach omniscience?”

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་དང་། བརྡ་དང་། གདགས་པ་དང་། ཐ་སྙད་འདི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་རྣམས་ལ་འདོགས་སམ།
en: “Śāradvatī­putra, then, does this name, symbol, designation, or term ‘bodhisattva’ apply to the five acquisitive psycho-physical aggregates?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གང་ལ་མིང་མེད་པ་དང་། བརྡ་མེད་པ་དང་། བཏགས་པ་མེད་པ་དང་། ཐ་སྙད་མེད་པ་དང་། མིང་དུ་གདགས་པ་མེད་པ་དང་། ལུས་མེད་པ་དང་། ལུས་ཀྱི་ལས་མེད་པ་དང་། ངག་མེད་པ་དང་། ངག་གི་ལས་མེད་པ་དང་། ཡིད་མེད་པ་དང་། ཡིད་ཀྱི་ལས་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: “No, Reverend Lord!”

source: རྣམ་པར་བྱང་བ་མེད་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་སྙམ་འམ།
en: “Śāradvatī­putra, is that which is without name, without symbol, without designation, without conventional expression, without denomination, without corporeal form, without physical actions, without speech, without verbal actions, without mind, without mental actions, without arising, without ceasing, without affliction, and without purification able to train in the transcendent perfection of wisdom and then attain emancipation in omniscience?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “No, Reverend Lord!”

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: “Śāradvatī­putra, so it is that when great bodhisattva beings have trained in the transcendent perfection of wisdom without apprehending anything, they will attain emancipation in omniscience.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the venerable Śāradvatī­putra asked the Blessed One as follows: “Reverend Lord!
